# SpotCoordinateElevationSuffix Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotCoordinateElevationSuffix Property
ParameterTypeId Class See Also
---
"Elevation Suffix"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotCoordinateElevationSuffix { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotCoordinateElevationSuffix As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotCoordinateElevationSuffix {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace